import { Planet } from '../types/planet';

export const planets: Planet[] = [
    {
        name: 'ดาวพุธ',
        imgUrl: '/images/game/planets/mercury.svg',
        planetDes:
            'ขนาดเล็กที่สุด จิ๋วแต่แจ๋ว มีฉายาว่าเตาไฟแช่แข็ง เพราะด้านหนึ่งร้อน ด้านหนึ่งเย็น สามารถหมุนรอบพระอาทิตย์ได้รวดเร็ว',
        personalDes:
            'เป็นดาวแห่งสติปัญญา การใช้ตรรกะ ชอบคิดอย่างเป็นเหตุเป็นผลนำมุมมองจากสิ่งรอบตัว มาประมวลผลอย่างรวดเร็วและรอบด้าน ก่อนจะเสนอไอเดียอะไรออกไป รับมือกับสถานการณ์ต่าง ๆ ด้วยความยืดหยุ่น',
    },
    {
        name: 'ดาวศุกร์',
        imgUrl: '/images/game/planets/venus.svg',
        detail: 'เป็นดาวแห่งความรัก ความงาม และศิลปะ',
        planetDes: 'เป็นดาวเคราะห์ที่สว่างที่สุด',
        personalDes:
            'คุณมีแนวคิดแบบ artist ในตัวสูง เปี่ยมด้วยแรงบันดาลใจ ชอบมองหาความเป็นไปได้ ให้ความสำคัญกับความรู้สึกของตนเองและผู้อื่น มีความยืดหยุ่น ไม่ยึดติดในกรอบ หรือระเบียบที่เคร่งครัดเกินไปจนไร้เหตุผล',
    },
    {
        name: 'ดาวโลก',
        imgUrl: '/images/game/planets/earth.svg',
        planetDes: 'ดาวเคราะห์แห่งชีวิต ทั้งอุณหภูมิ สภาพแวดล้อม พอดีไปหมด',
        personalDes:
            'เป็นคนอบอุ่น คิดถึงความรู้สึกของผู้คนรอบข้างเสมอ ชอบอยู่กับปัจจุบัน ถึงแม้จะมีแวบ ๆ ไปอดีตบ้าง เพราะชอบเก็บเรื่องที่ผ่านมาไว้เป็นบทเรียน ทำสิ่งต่าง ๆ อย่างเป็นระเบียบแบบแผน ',
    },
    {
        name: 'ดาวอังคาร',
        imgUrl: '/images/game/planets/mars.svg',
        planetDes:
            'ได้ชื่อว่าเป็น “ดาวสีเลือด” เป็นที่มาของชื่อ “Mars” ที่ตั้งตามชื่อของเทพเจ้าแห่งสงครามในตำนานโรมัน เพราะดาวมีสีแดงเรื่อ ซึ่งเกิดจากออกไซด์ของเหล็ก',
        personalDes:
            'สื่อถึง power  เป็นคนที่ตัดสินใจโดยยึดตามตรรกะ และพื้นฐานของความเป็นไปได้ ในขณะเดียวกัน ก็เชื่อในสัญชาตญาณของตัวเอง และพยายามทำทุกอย่างเป็นลำดับขั้น มีแบบแผน มีความเป็น perfectionist ในตัวสูง',
    },
    {
        name: 'ดาวพฤหัสบดี',
        imgUrl: '/images/game/planets/jupiter.svg',
        planetDes:
            'ดาวเคราะห์ที่ใหญ่ที่สุด หมุนรอบตัวเองเร็วที่สุด และเป็นดาวเคราะห์แก๊ส',
        detail: 'เป็นสัญลักษณ์ของโชค การเรียนรู้ และการเติบโต',
        personalDes:
            'มักเชื่อในสัญชาตญาณตนเอง หลาย ๆ ครั้งก็ปล่อยให้ตัวเองฟุ้งซ่าน เพื่อที่จะตกตะกอนความคิดในภายหลัง มองการณ์ไกล และเมื่อมีภาพอนาคตในหัวแล้ว ก็จะต้องวางแผนอย่างเป็นลำดับชั้น เพื่อไปถึงเป้าหมายที่ตั้งไว้',
    },
    {
        name: 'ดาวเสาร์',
        imgUrl: '/images/game/planets/saturn.svg',
        planetDes:
            'ดาวเคราะห์ได้รับฉายาว่า “ราชาแห่งวงแหวน” เพราะเป็นดาวเคราะห์ในระบบสุริยะจักรวาลที่มีวงแหวนปรากฎเด่นชัดสุด',
        personalDes:
            'คุณเป็นคนที่ใช้ชีวิตบนความเป็นจริง ชอบใช้ตระกะในการวิเคราะห์สถานการณ์ต่างๆ ชีวิตของคุณดําเนินตามแบบแผนขั้นตอนที่ ถูกกําหนดไว้ ไม่ชอบให้อารมณ์มาควบคุม การตัดสินใจในการใช้ชีวิตของคุณ',
    },
    {
        name: 'ดาวยูเรนัส',
        imgUrl: '/images/game/planets/uranus.svg',
        planetDes:
            'ดาวเคราะห์นี้เป็นตัวแทนแห่งสวรรค์ เพราะยูเรนัสเป็นเทพเจ้าแห่งท้องฟ้าของกรีก',
        personalDes:
            'คุณเป็นคนที่มีความคิดริเริ่ม มีแรงบันดาลใจสูง ในขณะเดียวกันก็อยู่บนหลักเหตุและผล พยายามไม่ใช้อารมณ์ในการตัดสิน ปฎิบัติต่อทุกคนอย่างเท่าเทียมและ ไม่ชอบควบคุมคนอื่น',
    },
    {
        name: 'ดาวเนปจูน',
        imgUrl: '/images/game/planets/neptune.svg',
        planetDes: 'เป็นดาวแห่งความคิดสร้างสรรค์ ความฝัน',
        personalDes:
            'คุณเป็นคนที่ให้ความสําคัญกับความรู้สึกของตัวเองและผู้อื่น ชอบตัดสินใจโดยใช้ความรู้สึก มีความยืดหยุ่นเป็นธรรมชาติ พร้อมที่จะปรับเปลี่ยนได้ตามสถานการณ์',
    },
];
