import { QueueListIcon } from '@heroicons/react/24/solid';
import { QuestionMarkCircleIcon } from '@heroicons/react/24/solid';
import { ArticleDetail } from '@/utils/article-page/types';
import React from 'react';
import ArticleBlock from './ArticleBlock';
import { References } from './References';

//mock data
const Detail: Array<ArticleDetail> = [
    {
        topic: 'Sexual harassment คืออะไร อะไรบ้างที่เรียกว่า Sexual harassment ?',
        icon: QueueListIcon,
        preinfo: `Sexual Harassment หรือการคุกคามทางเพศ ไม่ได้จำกัดไว้เพียงการข่มขืนกระทำชำเราเท่านั้น แต่ยังหมายรวมถึงการกระทำล่วงเกินใด ๆ ที่ทำให้เหยื่อรู้สึกไม่ปลอดภัยในชีวิต บ่อยครั้งที่ผู้กระทำคิดว่า “คงไม่เป็นอะไร” โดยหารู้ไม่ว่ามันคือฝันร้ายที่สร้างบาดแผลทางจิตใจให้กับเหยื่อจนยากที่จะลืมเลือน`,
        fullinfo: (
            <article className="prose">
                <p>
                    Sexual Harassment หรือการคุกคามทางเพศ
                    ไม่ได้จำกัดไว้เพียงการข่มขืนกระทำชำเราเท่านั้น
                    แต่ยังหมายรวมถึงการกระทำล่วงเกินใด ๆ
                    ที่ทำให้เหยื่อรู้สึกไม่ปลอดภัยในชีวิต
                    บ่อยครั้งที่ผู้กระทำคิดว่า “คงไม่เป็นอะไร”
                    โดยหารู้ไม่ว่ามันคือฝันร้ายที่สร้างบาดแผลทางจิตใจให้กับเหยื่อจนยากที่จะลืมเลือน
                </p>
                <p>
                    ความรุนแรงนี้ส่งผลกระทบถึงสภาพจิตใจของเหยื่อโดยตรง กล่าวคือ
                    มีคนต้องเผชิญกับโรคซึมเศร้า วิตกกังวล กลัวการออกไปเจอผู้คน
                    สิ่งเลวร้ายที่สุดคือ เคยมีคนจบชีวิตลงจากเหตุการณ์เหล่านี้
                </p>
                <p>อะไรบ้างที่เข้าข่ายการล่วงละเมิดทางเพศ เช่น</p>
                <ol>
                    <li>
                        การสัมผัสทางร่างกาย หรือแตะเนื้อต้องตัว (skinship)
                        โดยที่อีกฝ่ายไม่ยินยอมสมัครใจ เช่น การโอบกอด จับมือ
                        แตะไหล่ ย่อมเป็นสิ่งที่ควรหลีกเลี่ยงหากไม่จำเป็น
                    </li>

                    <li>
                        การใช้คำพูดล่อแหลมทางเพศ เช่น เล่นมุกตลกทางเพศ
                        ล้อเลียนเพศสภาพ หรือพูดถึงอวัยวะซ่อนเร้น
                    </li>

                    <li>
                        สีหน้า กิริยา ท่าทาง และการแทะโลมด้วยสายตา เช่น
                        จ้องมองจุดซ่อนเร้น หรือทำสีหน้าเพื่อยั่วยวนทางเพศ
                        อย่างการเลียรอบริมฝีปาก รวมถึงแอบจ้องมองแล้วช่วยตัวเอง
                    </li>

                    <li>
                        การส่งข้อความเชิงอนาจาร เช่น
                        การส่งรูปภาพหรือข้อความเชิงลามก ชวนมีเพศสัมพันธ์
                    </li>
                </ol>
                <p>
                    “มนุษย์ย่อมมีสิทธิเสรีภาพเหนือร่างกายตนเอง
                    ใครจะมาละเมิดมิได้”
                    คำกล่าวซึ่งปรากฏอยู่ตามสิทธิธรรมชาติของมนุษย์
                    และยังถูกบัญญัติไว้ในรัฐธรรมนูญอันเป็นกฎหมายสูงสุดของประเทศ
                    ผู้ใดถูกละเมิด ผู้นั้นย่อมต้องได้รับการคุ้มครอง
                </p>
                <p>
                    ในสังคมไทยปัจจุบันมีการหยิบยกประเด็นดังกล่าวขึ้นมาพูดในที่สาธารณะกันอย่างแพร่หลายขึ้น
                    อย่างไรก็ตามยังคงมีคนถูกล่วงละเมิดทางเพศที่ไม่ได้เป็นข่าว
                    และไม่ได้รับความเป็นธรรมอีกเป็นจำนวนมาก
                    เพื่อป้องกันไม่ให้เกิดภาพจำอันเลวร้ายขึ้น
                    เรามีส่วนช่วยผลักดันได้โดยการไม่เพิกเฉย
                    และเป็นกระบอกเสียงเพื่อช่วยสร้างความปกติใหม่ให้กับสังคมต่อไป
                </p>

                <h2> ผลกระทบ - การรับมือ</h2>
                <p>
                    การถูก Sexual Harassment หรือการคุกคามทางเพศ
                    ส่งผลร้ายแรงต่อผู้ถูกกระทำ ซ้ำร้ายสิ่งที่ซ้ำเติมยิ่งกว่า คือ
                    การที่สังคมตราหน้าผู้ถูกกระทำ
                    ว่าเป็นสาเหตุให้เกิดการคุมคามทางเพศ ซึ่งในความเป็นจริง
                    ไม่ว่าใครก็ตามที่ถูกกระทำล้วนได้รับผลกระทบที่ร้ายแรงในหลายแง่มุม
                    และสังคมควรจะโอบอุ้มใครก็ตามเหล่านั้นไว้
                    บทความนี้จะพาทุกคนไปรู้จักกับ ผลกระทบที่เกิดขึ้นจากการ
                    ถูกคุกคามทางเพศ
                    และเราจะรับมืออย่างไรหากเกิดเหตุการณ์เหล่านั้นขึ้นกับตัวเองและคนรอบข้าง
                </p>
                <p>
                    ผลกระทบของการถูกคุมคามทางเพศ สามารถแบ่งออกได้หลัก ๆ เป็น 2
                    ทาง คือ
                </p>
                <ol>
                    <li>
                        ผลกระทบทางร่างกาย โดยร่างกายมักได้รับการกระทบกระเทือน
                        ส่งผลให้เกิดอาการที่ผิดปกติ เช่น ปวดศีรษะ ปวดท้อง
                        มีอาการบาดเจ็บตามส่วนต่าง ๆ ของร่างกาย
                    </li>

                    <li>
                        ผลกระทบทางจิตใจ
                        โดยได้รับผลกระทบที่รุนแรงจนส่งผลต่ออารมณ์และจิตใจ เช่น
                        เศร้า โกรธ เครียด ขาดความมั่นใจ และอับอาย
                        มีอาการวิตกกังวล จนอาจถึงขั้นเป็นโรคซึมเศร้า
                    </li>
                </ol>
                <p>
                    นอกเหนือไปจากนั้น ผลกระทบเหล่านี้ยังส่งผลต่อบุคลิกภาพ
                    การใช้ชีวิตในแง่มุมอื่น ๆ ทั้งการอยู่ในครอบครัว และที่ทำงาน
                    ผลกระทบเหล่านี้มีความรุนแรงต่อผู้ถูกกระทำซึ่งต้องได้รับการเยียวยาอย่างเหมาะสม
                    โดยเราสามารถรับมือกับการถูกคุมคามทางเพศได้ ดังนี้
                </p>
                <ol>
                    <li>
                        เมื่ออยู่ในสถานการณ์ที่มีแนวโน้มจะถูกคุกคามทางเพศ
                        สามารถทำได้โดย รีบเอาตนเองออกมาจากสถานการณ์เสี่ยง
                        แจ้งให้คนบริเวณใกล้เคียงทราบ
                        ในกรณีที่สามารถบอกกล่าวผู้กระทำความผิดได้
                        ให้บอกกล่าวว่าการกระทำดังกล่าวเป็นการกระทำที่ผิด
                        บันทึกหลักฐานเหตุการณ์ที่เกิดขึ้น และดำเนินการทางกฎหมาย
                    </li>

                    <li>
                        เมื่อถูกคุกคามทางเพศ และมีสภาพจิตใจที่ย่ำแย่
                        ควรรีบไปพบแพทย์เพื่อตรวจร่างกายอย่างเร่งด่วน
                        ปรับวิธีคิดว่าเราไม่ใช่ฝ่ายผิด
                        เรียกความมั่นใจของตนเองกลับมมาให้เร็วที่สุด
                        อาจเปิดใจพุดคุยกับคนรอบข้างมากขึ้น
                        หากเหตุการณ์ดังกล่าวกระทบต่อสภาพจิตใจที่รุนแรงควรไปพบแพทย์เพื่อรับคำปรึกษาเป็นลำดับถัดไป
                    </li>
                </ol>
                <p>
                    เกราะป้องกันที่ดีที่สุดคือการที่สังคมช่วยกันให้ความสำคัญกับประเด็นดังกล่าว
                    เป็นหูเป็นตา
                    และอย่าปล่อยให้เรื่องดังกล่าวเป็นเรื่องที่ปกติในสังคม
                    ก่อนจะไปถึงปลายน้ำคือการที่ใครก็ตามต้องมารับผลกรรมจากเหตุการณ์ที่เกิดขึ้น
                    และกลายเป็นแผลที่อยู่ในใจของผู้ถูกกระทำไปตลอดชีวิต
                </p>

                <h3>อ้างอิง</h3>
                <References
                    links={[
                        'https://www.parliament.go.th/ewtadmin/ewt/elaw_parcy/download/article/article_20180220093930.pdf',
                        'https://www.manarom.com/blog/sexual_harassment.html',
                    ]}
                />

                <h2>สิ่งที่สังคมควรตระหนัก และจุฬา กับ Sexual harassment</h2>
                <p>
                    “Sexual harassment เป็นเรื่องของทุกคน” คำกล่าวข้างต้น
                    ดูจะไม่เกินจริงนัก เพราะการถูกคุกคามทางเพศ
                    สามารถเกิดขึ้นได้กับทุกเพศ ทุกวัย และเกิดขึ้นได้ในหลายรูปแบบ
                    ไม่เว้นแต่การคุกคามทางเพศในครอบครัว
                    การมีอยู่ของการคุกคามทางเพศ
                    ยังเกี่ยวข้องกับเราทุกคนที่อาจเป็นตัวแปรหนึ่งที่ทำให้การคุกคามทางเพศกลายเป็นเรื่องปกติที่เกิดขึ้นในสังคม
                    เพียงเพราะมันไม่ใช่เรื่องของเรา
                    บทความนี้จะพาทุกคนไปรู้จักกับ การมีอยู่ของ Sexual Harassment
                    สิ่งเหล่านี้อยู่ใกล้ตัวเรามากเพียงใด
                    และทำอย่างไรจึงจะเป็นส่วนหนึ่งในการต่อต้านความบิดเบี้ยวนี้ในสังคมได้
                </p>
                <p>
                    ปฏิเสธไม่ได้ว่าการมีอยู่ของ Sexual Harassment นั้นเกิดจาก
                    “ความเพิกเฉย” และ “การปลูกฝังค่านิยม” บางประการ
                    เมื่อความไม่ปกติเหล่านั้นเกิดซ้ำ ๆ
                    และไม่ถูกหยิบยกขึ้นมาเป็นปัญหาจึงกลับกลายเป็น “ความปกติ”
                    ขึ้นมาในสังคม
                    และได้กลายเป็นหนึ่งในปัจจัยสำคัญที่ทำให้เหยื่อไม่กล้าพูด
                    หรือแสดงความอึดอัดคับข้องใจออกมา
                </p>
                <p>
                    ครั้งหนึ่งมุกตลกที่เน้นเนื้อหาเกี่ยวกับเรื่องเพศ
                    เคยเป็นเรื่องที่นำเสนอได้อย่างสนุกปาก
                    หรือคำชื่นชมที่แฝงไปด้วยนัยยะที่ส่อเสียดล้วนไม่เคยเป็นที่พูดถึงในประเด็นสังคมมากนัก
                    หรือการที่เหยื่อถูกข่มขืนมักถูกตั้งคำถามถึงเสื้อผ้าบนเลือนร่างมากกว่าการพุ่งเป้าไปที่ผู้กระทำความผิด
                    หรือใกล้ตัวเราในฐานะ “เพื่อนใหม่” ในรั้วจุฬา ฯ
                    ก็เคยมีประเด็นเรื่องการคุกคามทางเพศเช่นกัน
                </p>
                <p>
                    ประเด็นเหล่านี้เคยเกิดขึ้นซ้ำแล้วซ้ำเล่า
                    และกลายเป็นเรื่องราวที่ปวดร้าวในชีวิตของใครหลายคน
                    ไม่เพียงแต่เราที่ต้องตระหนัักถึงสิทธิของผู้อื่น
                    หรือการที่ผู้ถูกคุกคามต้องปกป้องและเยียวยาตนเองให้เป็น
                    แต่คือการที่สังคมชูประเด็นเหล่านี้ขึ้นมาเพื่อพูดคุยมากขึ้น
                    เหมือนประเด็นข้างต้นที่ในปัจจุบันกลายเป็นเรื่องที่เรายอมรับไม่ได้
                    และพยายามหาทางออกที่เป็นธรรมที่สุดให้กับผู้ถูกกระทำ
                    ดังนั้นจึงควรเป็นหน้าที่ของเราในการทำให้เรื่องที่ “เคยปกติ”
                    กลายเป็นเรื่อง “ไม่ปกติ” ให้ได้
                </p>

                <h3>อ้างอิง</h3>
                <References
                    links={[
                        'https://thewmtd.com/sexual-harassment-ที่หล่อหลอมมากับวัฒน',
                        'https://adaymagazine.com/online-sexual-harassment-report/',
                        'https://www.parliament.go.th/ewtadmin/ewt/elaw_parcy/download/article/article_20180220093930.pdf',
                    ]}
                />

                <h2>จาก ‘บ้านรับน้อง’ สู่ ‘บ้านรับเพื่อน’</h2>
                <p>
                    ที่ผ่านมาเรามักจะได้ยินคำว่า ‘การรับน้อง’ อยู่บ่อยครั้ง
                    ภาพจำของใครหลาย ๆ คนเมื่อนึกถึงคงหนีไม่พ้น การบังคับ ข่มขู่
                    ว้ากตามอำเภอใจ
                    หรืออาจเป็นเนื้อเพลงที่ครั้งหนึ่งเราเคยสนุกสนาน
                    ขณะประสานไปกับเสียงกลอง เช่น
                    “มัดหมี่ขูดมะพร้าวทำกับข้าวอยู่ในครัว
                    มัดหมี่ไม่รู้ตัวถูกคนชั่วลากเอาไป….”
                </p>
                <p>
                    สิ่งเหล่านี้ได้ปรากฎในวัฒนธรรมที่มีจุดประสงค์เพื่อสร้างความแน่นแฟ้นขึ้นในสถาบัน
                    คือ ภาพสะท้อนของ “การคุกคามทางเพศ” ที่ใครต่อใครหลายคนมองข้าม
                    แยบยลไปกว่านั้นคือ วัฒนธรรมการ “รับน้อง” ถูกแฝงไปด้วย
                    อำนาจนิยม และ “ระบบอาวุโส” ที่ไม่อาจแยกให้ขาดออกจากกันได้
                    เช่นคำกล่าวที่ว่า “มาก่อนเป็นพี่ มาหลังเป็นน้อง
                    มาพร้อมเป็นเพื่อน” คำกล่าวนี้มีนัยยะที่สะท้อนลำดับขั้น
                    และความเป็นรุ่นพี่รุ่นน้องกลายมาเป็นข้ออ้างในการริดรอนสิทธิของผู้อื่น
                    ซึ่งในความเป็นจริงแล้ว
                    ไม่ว่าใครก็ตามมีสิทธิเสรีภาพเป็นของตนเองทั้งสิ้น
                </p>
                <p>
                    ด้วยเหตุนี้เราจึงสนับสนุนให้มีการจัดกิจกรรมในเชิงสร้างสรรค์
                    เป็นกันเอง สามารถเข้าร่วมตามความสมัครใจ
                    และพลิกนัยของการจัดกิจกรรมครั้งนี้ใหม่ โดยเปลี่ยนจาก
                    “บ้านรับน้อง” มาเป็น ‘บ้านรับเพื่อน’ เพราะไม่ว่าใครจะมาก่อน
                    มาหลัง เราต่างก็เป็นเพื่อนกัน
                    และเราจะเคารพในความเป็นมนุษย์ด้วยกันทั้งหมด
                </p>
            </article>
        ),
        img: '',
    },
];

const Article: React.FC = () => {
    return (
        <div>
            {Detail.map((article: ArticleDetail, index: number) => (
                <ArticleBlock article={article} index={index} key={index} />
            ))}
        </div>
    );
};

export default Article;
